In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
#pd.index allows you to name it at the same time. 
dFrame1 = DataFrame(np.arange(8).reshape((2,4)),
                    index=pd.Index(['LA','SF'],name='city'),
                    columns=pd.Index(['A','B','C','D'], name='letter'))

In [4]:
dFrame1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [5]:
#use stack to pivot the columns to rows
dFrame_st = dFrame1.stack()
dFrame_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int64

In [6]:
#rearange it back to dataframe 
dFrame_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [7]:
#unstack can be specified 
dFrame_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [8]:
#by city
dFrame_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [9]:
#unstack and stack with null values
ser1 = Series([0,1,2],index=['Q','X','Y'])

ser2 = Series([4,5,6], index=['X','Y','Z'])

In [10]:
#use dFrame to combine them with concat
dFrame = pd.concat([ser1,ser2],keys=['Alpha','Beta'])

dFrame

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [11]:
#to make it in dataframe we need to unstack
dFrame.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [12]:
#remove the null values - using both unstack and stack will filter out the null values 
dFrame.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [13]:
dFrame = dFrame.unstack()

In [14]:
dFrame

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [15]:
#call stack on it removes the nulls 
#with stack(dropna=False) we will keep the nulls
dFrame.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64